#+TAGS: OUTSTANDING(o) QUESTIONS(q)

**** Objects

     #+BEGIN_SRC python :session Objects :results output
       from urllib.request import urlopen
       shakes = urlopen('http://composingprograms.com/shakespeare.txt')
       text = shakes.read().split()
     #+END_SRC 

     #+BEGIN_SRC python :session Objects :results output
       print(len(text),'\n',text[:25],'\n', text.count(b'the'), '\n', text.count(b','))
     #+END_SRC 

     #+RESULTS:
     : 980637 
     :  [b'A', b"MIDSUMMER-NIGHT'S", b'DREAM', b'Now', b',', b'fair', b'Hippolyta', b',', b'our', b'nuptial', b'hour', b'Draws', b'on', b'apace', b':', b'four', b'happy', b'days', b'bring', b'in', b'Another', b'moon', b';', b'but', b'O'] 
     :  23272 
     :  81827

**** Sets 

     #+BEGIN_SRC python :session Objects :results output
       words = set(text)
       print(len(words),'\n',max(words))
     #+END_SRC 

     #+RESULTS:
     : 33505 
     :  b'zwaggered'

**** Reversals 

     #+BEGIN_SRC python :session Objects :results output
       print('draw'[::-1])
       print({w for w in words if w == w[::-1] and len(w)>4})
       print({w for w in words if w[::-1] in words and len(w) == 4})
       print({w for w in words if w[::-1] in words and len(w) > 6})
     #+END_SRC 

     #+RESULTS:
     : ward
     : {b'rever', b'madam', b'level', b'minim', b'redder', b'refer'}
     : {b'noon', b'snip', b'tops', b'smug', b'garb', b'maws', b'rail', b'flow', b'trap', b'ward', b'doom', b'rood', b'drab', b'dial', b'sees', b'stab', b'leer', b'keel', b'lees', b'wort', b'mood', b'spin', b'stop', b'leek', b'meed', b'loop', b'star', b'draw', b'teem', b'liar', b'poop', b'trow', b'gums', b'spot', b'gnat', b'room', b'elle', b'door', b'hoop', b'tang', b'bard', b'swam', b'live', b'pooh', b'deed', b'laid', b'rats', b'evil', b'seel', b'nips', b'brag', b'ecce', b'pool', b'spit', b'part', b'tips', b'pots', b'moor', b'meet', b'esse', b'peep', b'reel', b'deem', b'pins', b'wolf', b'deer', b'port', b'trop', b'bats', b'reed'}
     : set()
     
***** Code
      Statements and expressions

      #+BEGIN_SRC python 
        from math import pi
        tau = 2 * pi
        return pi, tau
      #+END_SRC 

      #+RESULTS:
      | 3.141592653589793 | 6.283185307179586 |

***** Execution rule for assignment statements:
      - Evaluate all expressions to the right of = from left to right.
      - Bind all names to the left of = to those resulting values in the current frame.
       
      #+BEGIN_SRC python :results output
        a = 1
        b = 2
        b, a = a + b, b
        print(a,b)
      #+END_SRC

      #+RESULTS:
      : 2 3

***** Pure Funcs
      just return *values*: ~abs()~   
     
      #+begin_src python 
        return abs(-2)
      #+end_src

      #+RESULTS:
      : 2

***** Non-Pure Funcs     
      return *values(None)* and have *side effects*: ~print()~

      #+begin_src python :results output
        a = print(2)
        print(a)
      #+end_src

      #+RESULTS:
      : 2
      : None

**** Nested Expressions with Print
    
     #+begin_src python :results output
       a = print(print(1), print(2))
       print(a)
     #+end_src

     #+RESULTS:
     : 1
     : 2
     : None None
     : None
    
**** Multiple Envs in One Diagram!
    
     #+BEGIN_SRC python :results output
       from operator import mul
       def square(x):
           return mul(x, x);
       print(square(square(3)))
     #+END_SRC 

     #+RESULTS:
     : 81

     An env is a sequence of frames.
     - The global frame alone
     - A local, then the global frame
     *One env per frame here* 
**** Names Have Different Meanings in Different Envs
    
     #+BEGIN_SRC python :results output
       from operator import mul
       def square(square):
           return mul(square, square)
       print(square(4))
     #+END_SRC 

     #+RESULTS:
     : 16

     *A call expression and the body of the func being called are evaluated in different envs*

     | call of square(4) | ENV1:Global                |
     | body of square(4) | ENV2:f1 followed by Global |

***** Addition 

      #+BEGIN_SRC python :results output
        print(2+3*4+5,'\n',(2+3)*(4+5))
      #+END_SRC 

      #+RESULTS:
      : 19 
      :  45

***** Division

      #+BEGIN_SRC python :results output
        print(618 / 10, 618 // 10, 618 % 10)
        from operator import truediv, floordiv, mod
        print(truediv(618, 10), floordiv(618, 10), mod(618, 10))
      #+END_SRC 

      #+RESULTS:
      : 61.8 61 8
      : 61.8 61 8

**** Multiple Return Values 

     #+BEGIN_SRC python :results output
       def divide_exact(n, d):
           return n // d, n % d
       quotient, remainder = divide_exact(618, 10)
       print(quotient, remainder)
     #+END_SRC 

     #+RESULTS:
     : 61 8

*** Objects

    #+BEGIN_SRC python :session Objects :results output
      from urllib.request import urlopen
      shakes = urlopen('http://composingprograms.com/shakespeare.txt')
      text = shakes.read().split()
    #+END_SRC 

    #+BEGIN_SRC python :session Objects :results output
      print(len(text),'\n',text[:25],'\n', text.count(b'the'), '\n', text.count(b','))
    #+END_SRC 

    #+RESULTS:
    : 980637 
    :  [b'A', b"MIDSUMMER-NIGHT'S", b'DREAM', b'Now', b',', b'fair', b'Hippolyta', b',', b'our', b'nuptial', b'hour', b'Draws', b'on', b'apace', b':', b'four', b'happy', b'days', b'bring', b'in', b'Another', b'moon', b';', b'but', b'O'] 
    :  23272 
    :  81827

*** Sets 

    #+BEGIN_SRC python :session Objects :results output
      words = set(text)
      print(len(words),'\n',max(words))
    #+END_SRC 

    #+RESULTS:
    : 33505 
    :  b'zwaggered'

*** Reversals 

    #+BEGIN_SRC python :session Objects :results output
      print('draw'[::-1])
      print({w for w in words if w == w[::-1] and len(w)>4})
      print({w for w in words if w[::-1] in words and len(w) == 4})
      print({w for w in words if w[::-1] in words and len(w) > 6})
    #+END_SRC 

    #+RESULTS:
    : ward
    : {b'rever', b'madam', b'level', b'minim', b'redder', b'refer'}
    : {b'noon', b'snip', b'tops', b'smug', b'garb', b'maws', b'rail', b'flow', b'trap', b'ward', b'doom', b'rood', b'drab', b'dial', b'sees', b'stab', b'leer', b'keel', b'lees', b'wort', b'mood', b'spin', b'stop', b'leek', b'meed', b'loop', b'star', b'draw', b'teem', b'liar', b'poop', b'trow', b'gums', b'spot', b'gnat', b'room', b'elle', b'door', b'hoop', b'tang', b'bard', b'swam', b'live', b'pooh', b'deed', b'laid', b'rats', b'evil', b'seel', b'nips', b'brag', b'ecce', b'pool', b'spit', b'part', b'tips', b'pots', b'moor', b'meet', b'esse', b'peep', b'reel', b'deem', b'pins', b'wolf', b'deer', b'port', b'trop', b'bats', b'reed'}
    : set()
     
**** Code
     Statements and expressions

     #+BEGIN_SRC python 
       from math import pi
       tau = 2 * pi
       return pi, tau
     #+END_SRC 

     #+RESULTS:
     | 3.141592653589793 | 6.283185307179586 |

**** Execution rule for assignment statements:
     - Evaluate all expressions to the right of = from left to right.
     - Bind all names to the left of = to those resulting values in the current frame.
       
     #+BEGIN_SRC python :results output
       a = 1
       b = 2
       b, a = a + b, b
       print(a,b)
     #+END_SRC

     #+RESULTS:
     : 2 3

**** Pure Funcs
     just return *values*: ~abs()~   
     
     #+begin_src python 
       return abs(-2)
     #+end_src

     #+RESULTS:
     : 2

**** Non-Pure Funcs     
     return *values(None)* and have *side effects*: ~print()~

     #+begin_src python :results output
       a = print(2)
       print(a)
     #+end_src

     #+RESULTS:
     : 2
     : None

*** Nested Expressions with Print
    
    #+begin_src python :results output
      a = print(print(1), print(2))
      print(a)
    #+end_src

    #+RESULTS:
    : 1
    : 2
    : None None
    : None
    
*** Multiple Envs in One Diagram!
    
    #+BEGIN_SRC python :results output
      from operator import mul
      def square(x):
          return mul(x, x);
      print(square(square(3)))
    #+END_SRC 

    #+RESULTS:
    : 81

    An env is a sequence of frames.
    - The global frame alone
    - A local, then the global frame
    *One env per frame here* 
*** Names Have Different Meanings in Different Envs
    
    #+BEGIN_SRC python :results output
      from operator import mul
      def square(square):
          return mul(square, square)
      print(square(4))
    #+END_SRC 

    #+RESULTS:
    : 16

    *A call expression and the body of the func being called are evaluated in different envs*

    | call of square(4) | ENV1:Global                |
    | body of square(4) | ENV2:f1 followed by Global |

**** Addition 

     #+BEGIN_SRC python :results output
       print(2+3*4+5,'\n',(2+3)*(4+5))
     #+END_SRC 

     #+RESULTS:
     : 19 
     :  45

**** Division

     #+BEGIN_SRC python :results output
       print(618 / 10, 618 // 10, 618 % 10)
       from operator import truediv, floordiv, mod
       print(truediv(618, 10), floordiv(618, 10), mod(618, 10))
     #+END_SRC 

     #+RESULTS:
     : 61.8 61 8
     : 61.8 61 8

*** Multiple Return Values 

    #+BEGIN_SRC python :results output
      def divide_exact(n, d):
          return n // d, n % d
      quotient, remainder = divide_exact(618, 10)
      print(quotient, remainder)
    #+END_SRC 

    #+RESULTS:
    : 61 8

